#include<stdio.h>
#include<math.h>


// Exercise4-Practice2//Gas
int main(){
     int age;
     float Weight;


     printf("age : ");
     scanf("%d",&age);
     printf("Weight : ");
     scanf("%f",&Weight);

     if(age < 0 &&  age < 20 && Weight <= 60){
         printf("ورزش روزی دو ساعت - کوه نوردی هفتع ایی یک بار- والیبال با بسکتبال هفتع ایی دوبار");
     }
     else if (age < 0 && age < 20 && Weight <= 80 && Weight >= 60)
     {
         printf("ورزش روزی چهار ساعت - کوه نوردی هفتع ایی دو بار- تنیس هفته ایی 3 ساعت - استخر هفته ایی دو بار");
     }
     else if (age > 20 && age < 30 && Weight <= 60)
     {
         printf(" ورزش روزی یک ساعت و نیم - کوه نوردی هفتع ایی یک بار- استخر هفته ایی دو بار -رژیم غذا");
     }
     else if (age > 20 && age < 30 && Weight <= 80 && Weight >= 60)
     {
          printf("  ورزش روزی یک ساعت و نیم - کوه نوردی هفتع ایی یک بار- استخر هفته ایی دو بار -رژیم غذاسنگین");
     }
     else if (age > 30 && age < 40 && Weight <= 60)
     {
        printf("ورزش روزی یک ساعت - کوهنوردی دوبار در ماه - استخر هفته ایی سه بار - پیاده روی هفته ایی دوبار");
     }
     else if (age > 30 && age < 40 && Weight <= 80 && Weight >= 60)
     {
        printf("ورزش روزی یک ساعت - کوهنوردی سه در ماه - استخر هفته ایی سه بار - پیاده روی هفته ایی دوبار");
     }
      else if (age > 40 && age < 50 && Weight <= 80)
     {
        printf("ورزش روزی یک ساعت - کوهنوردی سه در ماه - استخر هفته ایی سه بار - پیاده روی هفته ایی دوبار");
     }
      else if (age > 40 && age < 50 && Weight <= 80 && Weight >= 60)
     {
        printf("ورزش روزی یک ساعت - کوهنوردی سه در ماه - استخر هفته ایی سه بار - پیاده روی هفته ایی دوبار - رژیم غذایی معتدل");
     }
     else {
         printf("ورزش روزی یک ساعت - کوهنوردی سه در ماه - استخر هفته ایی سه بار - پیاده روی هفته ایی دوبار - رژیم غذایی معتدل - نرمش هر روز");
     }
     return 0;

}
